app/views/users/show.html.erb

SELECT  1 AS one FROM "complaints" WHERE "complaints"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
---
  <div class="col-md-8">
    <% if @user.complaints.any? %>