app/views/shared/_user_info.html.erb

<span><%= link_to "view my profile", current_user %></span>
<span><%= pluralize(current_user.complaints.count, "complaint") %></span>
---
SELECT COUNT(*) FROM "complaints" WHERE "complaints"."user_id" = ?  [["user_id", 101]]