app/controllers/complaints_controller.rb

INSERT INTO "complaints" ("content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["content", "fan"], ["user_id", 101], ["created_at", "2018-08-17 18:17:35.500306"], ["updated_at", "2018-08-17 18:17:35.500306"]]
---
  def create
      @complaint= current_user.complaints.build(complaint_params)
      if @complaint.save

DELETE FROM "complaints" WHERE "complaints"."id" = ?  [["id", 14]]
SELECT  "complaints".* FROM "complaints" WHERE "complaints"."id" = ? ORDER BY "complaints"."created_at" DESC LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def destroy
      Complaint.find(params[:id]).destroy