app/controllers/users_controller.rb

  def show
    @user= User.find(params[:id])
    @complaints = @user.complaints.paginate(page: params[:page])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "complaints".* FROM "complaints" WHERE "complaints"."user_id" = ? ORDER BY "complaints"."created_at" DESC LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "complaints" WHERE "complaints"."user_id" = ?  [["user_id", 1]]

  def create
    @user = User.new(user_params)    # Not the final implementation!
    if @user.save
---
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)